# 7. Реализовать проект «Операции с комплексными числами». Создайте класс «Комплексное
# число». Реализуйте перегрузку методов сложения и умножения комплексных чисел.
# Проверьте работу проекта. Для этого создаёте экземпляры класса (комплексные числа),
# выполните сложение и умножение созданных экземпляров. Проверьте корректность
# полученного результата.

# For Taecher: Сделал и через переменную complex и просто передачей отдельных аргументов (см файл L8 HW 7_2)

class ComplexNumbers:
    pass
    # атрибуты класса:
    # Конструктор с атрибутами объекта:
    def __init__(self, arg):
        self.arg = arg
    # методы класса:
    def __add__(self, other):
        return f'Результат сложения комплексного числа: {self.arg + other.arg}\n'

    def __mul__(self, other):
        return f'Результат умножения комплексного числа: {self.arg * other.arg}\n'



# Объект класса:

x = complex(10, 8)
y = complex(7, 10)

xC = ComplexNumbers(x)
yC = ComplexNumbers(y)

print(xC + yC)
print(xC * yC)
