# 4. Реализуйте базовый класс Car .
# ● у класса должны быть следующие атрибуты: speed, color, name, i s_police ( булево). А
# также методы: go, stop, t urn(direction), которые должны сообщать, что машина
# поехала, остановилась, повернула (куда);
# ● опишите несколько дочерних классов: TownCar , SportCar , WorkCar , PoliceCar ;
# ● добавьте в базовый класс метод show_speed, который должен показывать текущую
# скорость автомобиля;
# © geekbrains.ru 19
# ● для классов TownCar и WorkCar переопределите метод show_speed. При значении
# скорости свыше 60 ( TownCar) и 40 ( WorkCar) должно выводиться сообщение о
# превышении скорости.
# Создайте экземпляры классов, передайте значения атрибутов. Выполните доступ к
# атрибутам, выведите результат. Вызовите методы и покажите результат.



