# 4) Программа принимает действительное положительное число x и целое отрицательное число
# y. Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать
# в виде функции my_func(x, y). При решении задания необходимо обойтись без встроенной
# функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с
# помощью оператора **. Второй — более сложная реализация без оператора **,
# предусматривающая использование цикла.

# я так во делал:
# def my_func(my_list):
#     my_list.remove(min(my_list))
#     return sum(my_list)
#
#
# num_1 = int(input('a = '))
# num_2 = int(input('b = '))
# num_3 = int(input('c = '))
# print(f'Сумма наибольших двух аргументов равна: {my_func([num_1, num_2, num_3])}')
